of40/tutorials/rheoEFoam/EEI/PoissonBoltzmann/FlowFocusing/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{   
    inlet_top
    {
       type             fixedValue;
        value           uniform 0;
    }
    inlet_down
    {
       type             fixedValue;
        value           uniform 0;
    }
    inlet_left
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    outlet_right
    {
        type            fixedValue;
        value           uniform 0;
    }
   
    walls
    {
        type            fixedFluxExtrapolatedPressure;
        value           uniform 0;
    }
    
    "(top|base)"
    {
        type            empty;
    }
}

// ************************************************************************* //
